import NoToWord from './NoToWord';

export default class FaNoToWord extends NoToWord
{
  t = {
    'and' : ' و ',
    '-' : 'منفی ',
    '+' : 'مثبت ',
    '.' : ' ممیز ',
  };
  floats = {
    1 : ' دهم',
    2 : ' صدم',
    3 : ' هزارم',
    4 : ' ده هزارم',
    5 : ' صد هزارم',
  };
  digit1 = {
      0 : 'صفر',
      1 : 'یک',
      2 : 'دو',
      3 : 'سه',
      4 : 'چهار',
      5 : 'پنج',
      6 : 'شش',
      7 : 'هفت',
      8 : 'هشت',
      9 : 'نه'
  };
  digit2_before_20 = {
      1 : 'یازده',
      2 : 'دوازده',
      3 : 'سیزده',
      4 : 'چهارده',
      5 : 'پانزده',
      6 : 'شانزده',
      7 : 'هفده',
      8 : 'هجده',
      9 : 'نوزده'
  };
  digit2 = {
      1 : 'ده',
      2 : 'بیست',
      3 : 'سی',
      4 : 'چهل',
      5 : 'پنجاه',
      6 : 'شصت',
      7 : 'هفتاد',
      8 : 'هشتاد',
      9 : 'نود'
  };
  digit3 = {
      1 : 'صد',
      2 : 'دویست',
      3 : 'سیصد',
      4 : 'چهارصد',
      5 : 'پانصد',
      6 : 'ششصد',
      7 : 'هفتصد',
      8 : 'هشتصد',
      9 : 'نهصد'
  };
  steps = {
      1 : 'هزار',
      2 : 'میلیون',
      3 : 'میلیارد',
      4 : 'تریلیون',
      5 : 'کادریلیون',
      6 : 'کوینتریلیون',
      7 : 'سکستریلیون',
      8 : 'سپتریلیون',
      9 : 'اکتریلیون',
      10 : 'نونیلیون',
      11 : 'دسیلیون'
  };
}